`terraform plan` output:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # aws_efs_backup_policy.hub_homedirs["workshop"] will be created
  + resource "aws_efs_backup_policy" "hub_homedirs" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.hub_homedirs["workshop"] will be created
  + resource "aws_efs_file_system" "hub_homedirs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "hub-homedirs-workshop"
        }
      + tags_all                = {
          + "Name" = "hub-homedirs-workshop"
        }
      + throughput_mode         = "bursting"

      + lifecycle_policy {
          + transition_to_primary_storage_class = "AFTER_1_ACCESS"
        }
      + lifecycle_policy {
          + transition_to_ia = "AFTER_90_DAYS"
        }

      + protection (known after apply)
    }

  # aws_efs_mount_target.hub_homedirs["subnet-0048ebd5f1c78fc2f.hub-homedirs-workshop"] will be created
  + resource "aws_efs_mount_target" "hub_homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-00367966724e1205e",
        ]
      + subnet_id              = "subnet-0048ebd5f1c78fc2f"
    }

  # aws_efs_mount_target.hub_homedirs["subnet-0c6a10d3839a0697d.hub-homedirs-workshop"] will be created
  + resource "aws_efs_mount_target" "hub_homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-00367966724e1205e",
        ]
      + subnet_id              = "subnet-0c6a10d3839a0697d"
    }

  # aws_efs_mount_target.hub_homedirs["subnet-0dcca381809b80b79.hub-homedirs-workshop"] will be created
  + resource "aws_efs_mount_target" "hub_homedirs" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-00367966724e1205e",
        ]
      + subnet_id              = "subnet-0dcca381809b80b79"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ nfs_server_dns_list       = [
        "fs-05f0845c8a4f0b5a5.efs.us-west-2.amazonaws.com",
      + (known after apply),
    ]

```